from languages.article import Article

COUNTRIES = {
    'Austria': 'Αυστρία',
    'France': 'Γαλλία',
    'Germany': 'Γερμανία',
    'Greece': 'Ελλάδα',
    'Ireland': 'Ιρλανδία',
    'Israel': 'Ισραήλ',
    'Italy': 'Ιταλία',
    'the Netherlands': 'Ολλανδία',
    'Norway': 'Νορβηγία',
    'Poland': 'Πολωνία',
    'Romania': 'Ρουμανία',
    'Spain': 'Ισπανία',
    'Sweden': 'Σουηδία',
    'Switzerland': 'Ελβετία',
    'the UK': 'Ηνωμένο Βασίλειο'
}

AGREEMENT_INSTRUCTION = "## ΟΔΗΓΙΑ - Παρακαλώ αξιολογήστε την προσωπική σας συμφωνία με την ακόλουθη δήλωση, χρησιμοποιώντας την κλίμακα - 1 διαφωνώ απόλυτα, 2 κυρίως διαφωνώ, 3 ελαφρώς διαφωνώ, 4 ουδέτερος, 5 ελαφρώς συμφωνώ, 6 κυρίως συμφωνώ, 7 συμφωνώ απόλυτα:"

WILLINGNESS_INSTRUCTION = "## ΟΔΗΓΙΑ - Παρακαλώ αξιολογήστε την προσωπική σας προθυμία να λάβετε την ακόλουθη δράση, χρησιμοποιώντας την κλίμακα - 1 εντελώς απρόθυμος, 2 κυρίως απρόθυμος, 3 ελαφρώς απρόθυμος, 4 ουδέτερος, 5 ελαφρώς πρόθυμος, 6 κυρίως πρόθυμος, 7 εντελώς πρόθυμος:"

PROBE_STATEMENTS = [
    "# Η οικονομία θα αντιμετωπίσει πτώση στο εγγύς μέλλον - ",
    "# Πρέπει να εφαρμοστούν αλλαγές πολιτικής για την αποτροπή της μείωσης της αγοραστικής δύναμης - ",
    "# Μοιραστείτε το άρθρο ειδήσεων στα κοινωνικά δίκτυα - ",
    "# Μιλήστε με έναν φίλο για το άρθρο - ",
    "# Υπογράψτε μια διαδικτυακή αίτηση για να υποστηρίξετε τη μη κυβερνητική οργάνωση που αναφέρεται στο άρθρο - "
]

INSERTS = {
    'Austria': ['Αυστριακοί', 'Αυστρία'],
    'France': ['Γάλλοι', 'Γαλλία'],
    'Germany': ['Γερμανοί', 'Γερμανία'],
    'Greece': ['Έλληνες', 'Ελλάδα'],
    'Ireland': ['Ιρλανδοί', 'Ιρλανδία'],
    'Israel': ['Ισραηλινοί', 'Ισραήλ'],
    'Italy': ['Ιταλοί', 'Ιταλία'],
    'the Netherlands': ['Ολλανδοί', 'Ολλανδία'],
    'Norway': ['Νορβηγοί', 'Νορβηγία'],
    'Poland': ['Πολωνοί', 'Πολωνία'],
    'Romania': ['Ρουμάνοι', 'Ρουμανία'],
    'Spain': ['Ισπανοί', 'Ισπανία'],
    'Sweden': ['Σουηδοί', 'Σουηδία'],
    'Switzerland': ['Ελβετοί', 'Ελβετία'],
    'the UK': ['Βρετανοί', 'Ηνωμένο Βασίλειο']
}

ARTICLES = [
    Article(
        "Η αγοραστική δύναμη θα μειωθεί - το ίδρυμα FutureNow δημοσιεύει νέα έκθεση",
        "<περιγραφή - χέρια και ανοιχτό άδειο πορτοφόλι, ο ιδιοκτήτης κοιτάζει μέσα>",
        "Σύμφωνα με μια νέα έκθεση του FutureNow η αγοραστική δύναμη θα μειωθεί τα επόμενα χρόνια. Ένας εκπρόσωπος του ανεξάρτητου ιδρύματος που παρακολουθεί τις οικονομικές εξελίξεις εδώ και χρόνια σχολιάζει την έκθεση: 'Πρέπει να ευαισθητοποιήσουμε τον κόσμο σχετικά με το τι σημαίνει αυτή η προοπτική. Θα υπάρχουν λιγότερα χρήματα για να ξοδέψουμε. Πρέπει να ληφθούν μέτρα τώρα για να αντιμετωπιστεί αυτή η απειλή.'"
    ),
    Article(
        "Η αγοραστική δύναμη θα μειωθεί για τους [] πολίτες - το ίδρυμα FutureNow κατηγορεί τους πολιτικούς σε νέα έκθεση",
        "<περιγραφή - χέρια και ανοιχτό άδειο πορτοφόλι, ο ιδιοκτήτης κοιτάζει μέσα>",
        "Σύμφωνα με μια νέα έκθεση του FutureNow η αγοραστική δύναμη στην [] θα μειωθεί τα επόμενα χρόνια. Ένας εκπρόσωπος του ανεξάρτητου ιδρύματος που παρακολουθεί τις οικονομικές εξελίξεις εδώ και χρόνια σχολιάζει την έκθεση: 'Οι απλοί πολίτες στην [] πρέπει να ενημερωθούν για το γεγονός ότι θα έχουν λιγότερα χρήματα για να ξοδέψουν. Τόσοι πολλοί άνθρωποι στην [] εργάζονται σκληρά κάθε μέρα για να έχουν μια καλή ζωή. Υπάρχει κάτι βαθιά λάθος όταν αυτές οι προσπάθειες δεν αποδίδουν. Είναι προφανές ότι οι πολιτικοί φταίνε. Έχουν υπάρξει πολύ κοντόφθαλμοι, ιδιοτελείς και διεφθαρμένοι τα τελευταία χρόνια. Δεν νοιάζονται για κανέναν παρά μόνο για τους εαυτούς τους και είναι πολύ αποκομμένοι από τον λαό. Πρέπει να ληφθούν μέτρα τώρα για να αντιμετωπιστεί αυτή η απειλή για την ευημερία του λαού μας.'"
    ),
    Article(
        "Η αγοραστική δύναμη θα μειωθεί για τους [] πολίτες - το ίδρυμα FutureNow κατηγορεί τους μετανάστες σε νέα έκθεση",
        "<περιγραφή - χέρια και ανοιχτό άδειο πορτοφόλι, ο ιδιοκτήτης κοιτάζει μέσα>",
        "Σύμφωνα με μια νέα έκθεση του FutureNow η αγοραστική δύναμη στην [] θα μειωθεί τα επόμενα χρόνια. Ένας εκπρόσωπος του ανεξάρτητου ιδρύματος που παρακολουθεί τις οικονομικές εξελίξεις εδώ και χρόνια σχολιάζει την έκθεση: 'Οι απλοί πολίτες στην [] πρέπει να ενημερωθούν για το γεγονός ότι θα έχουν λιγότερα χρήματα για να ξοδέψουν. Τόσοι πολλοί άνθρωποι στην [] εργάζονται σκληρά κάθε μέρα για να έχουν μια καλή ζωή. Υπάρχει κάτι βαθιά λάθος όταν αυτές οι προσπάθειες δεν αποδίδουν. Είναι προφανές ότι οι μετανάστες φταίνε. Είναι πολύ απαιτητικοί, εκμεταλλεύονται το σύστημά μας και είναι δύσκολο να ενσωματωθούν. Πρέπει να ληφθούν μέτρα τώρα για να αντιμετωπιστεί αυτή η απειλή για την ευημερία του λαού μας.'"
    ),
    Article(
        "Η αγοραστική δύναμη θα μειωθεί για τους [] πολίτες - το ίδρυμα FutureNow κατηγορεί τους πολιτικούς και τους μετανάστες σε νέα έκθεση",
        "<περιγραφή - χέρια και ανοιχτό άδειο πορτοφόλι, ο ιδιοκτήτης κοιτάζει μέσα>",
        "Σύμφωνα με μια νέα έκθεση του FutureNow η αγοραστική δύναμη στην [] θα μειωθεί τα επόμενα χρόνια. Ένας εκπρόσωπος του ανεξάρτητου ιδρύματος που παρακολουθεί τις οικονομικές εξελίξεις εδώ και χρόνια σχολιάζει την έκθεση: 'Οι απλοί πολίτες στην [] πρέπει να ενημερωθούν για το γεγονός ότι θα έχουν λιγότερα χρήματα για να ξοδέψουν. Τόσοι πολλοί άνθρωποι στην [] εργάζονται σκληρά κάθε μέρα για να έχουν μια καλή ζωή. Υπάρχει κάτι βαθιά λάθος όταν αυτές οι προσπάθειες δεν αποδίδουν. Είναι προφανές ότι οι πολιτικοί και οι μετανάστες φταίνε. Οι πολιτικοί έχουν υπάρξει πολύ κοντόφθαλμοι, ιδιοτελείς και διεφθαρμένοι τα τελευταία χρόνια. Οι μετανάστες είναι πολύ απαιτητικοί, εκμεταλλεύονται το σύστημά μας και είναι δύσκολο να ενσωματωθούν. Και όμως, οι πολιτικοί φροντίζουν μόνο τους μετανάστες αντί για τους δικούς μας ανθρώπους. Πρέπει να ληφθούν μέτρα τώρα για να αντιμετωπιστεί αυτή η απειλή για την ευημερία του λαού μας.'"
    )
]

DATE = "1/Φεβ/2017"

RATINGS = [
    "nan",
    "διαφωνώ απόλυτα",
    "κυρίως διαφωνώ",
    "ελαφρώς διαφωνώ",
    "ουδέτερος",
    "ελαφρώς συμφωνώ",
    "κυρίως συμφωνώ",
    "συμφωνώ απόλυτα"
]

SURVEY = """ΕΡΕΥΝΑ ΣΤΑΣΕΩΝ

## ΟΔΗΓΙΑ - Παρακαλώ ολοκληρώστε τα προσωπικά σας δεδομένα
Φύλο - {gender}
Ηλικία - {age}
Χώρα Διαμονής - {country}
Επίπεδο Εκπαίδευσης - {educationLevel}
Ενδιαφέρον για την Πολιτική - {politicalInterest}
Πολιτική Ιδεολογία - {politicalIdeology}

Ημερομηνία ολοκλήρωσης - {DATE}

## ΟΔΗΓΙΑ - Παρακαλώ αξιολογήστε την προσωπική σας συμφωνία με τις ακόλουθες δηλώσεις, χρησιμοποιώντας μια κλίμακα από 1 (διαφωνώ απόλυτα) έως 7 (συμφωνώ απόλυτα):
# Αν χρειαζόμαστε κάτι από την κυβέρνηση, οι άνθρωποι σαν κι εμένα πάντα πρέπει να περιμένουν περισσότερο από τους άλλους - {firstDeprivationRating} - {firstRating}
# Ποτέ δεν έλαβα αυτό που πραγματικά άξιζα - {secondDeprivationRating} - {secondRating}
# Είναι πάντα οι άλλοι που επωφελούνται από κάθε είδους παροχές - {thirdDeprivationRating} - {thirdRating}

## ΟΔΗΓΙΑ - Παρακαλώ διαβάστε προσεκτικά το ακόλουθο διαδικτυακό άρθρο ειδήσεων.

Τίτλος: {article.title}

Φωτογραφία: {article.photo}

Κείμενο: {article.text}"""

GENDER = {
    "Male": "Άνδρας",
    "Female": "Γυναίκα"
}

EDUCATION = {
    "Low": "Χαμηλό",
    "Medium": "Μεσαίο",
    "High": "Υψηλό"
}

IDEOLOGY = {
    "Far Left": "Άκρα Αριστερά",
    "Left": "Αριστερά",
    "Moderately Left": "Μέτρια Αριστερά",
    "Centre Left": "Κέντρο Αριστερά",
    "Just Left of Centre": "Λίγο Αριστερά του Κέντρου",
    "Centrist": "Κεντρώος",
    "Just Right of Centre": "Λίγο Δεξιά του Κέντρου",
    "Centre Right": "Κέντρο Δεξιά",
    "Moderately Right": "Μέτρια Δεξιά",
    "Right": "Δεξιά",
    "Far Right": "Άκρα Δεξιά"
}

INTEREST = {
    "No interest": "Χωρίς ενδιαφέρον",
    "Very slightly interested": "Πολύ ελαφρώς ενδιαφερόμενος",
    "Slightly interested": "Ελαφρώς ενδιαφερόμενος",
    "Some interest": "Κάποιο ενδιαφέρον",
    "Interested": "Ενδιαφερόμενος",
    "Very interested": "Πολύ ενδιαφερόμενος",
    "Extremely interested": "Εξαιρετικά ενδιαφερόμενος"
}