from languages.article import Article

COUNTRIES = {
    'Austria': 'אוסטריה',
    'France': 'צרפת',
    'Germany': 'גרמניה',
    'Greece': 'יוון',
    'Ireland': 'אירלנד',
    'Israel': 'ישראל',
    'Italy': 'איטליה',
    'the Netherlands': 'הולנד',
    'Norway': 'נורווגיה',
    'Poland': 'פולין',
    'Romania': 'רומניה',
    'Spain': 'ספרד',
    'Sweden': 'שוודיה',
    'Switzerland': 'שווייץ',
    'the UK': 'המלכה המאוחדת'
}

AGREEMENT_INSTRUCTION = "## הוראה - בבקשה דרגו את מידת ההסכמה האישית שלכם עם ההצהרה הבאה, באמצעות הסולם - 1 לחלוטין לא מסכים, 2 בעיקר לא מסכים, 3 קצת לא מסכים, 4 נייטרלי, 5 קצת מסכים, 6 בעיקר מסכים, 7 לחלוטין מסכים:"

WILLINGNESS_INSTRUCTION = "## הוראה - בבקשה דרגו את מידת המוכנות האישית שלכם לבצע את הפעולה הבאה, באמצעות הסולם - 1 לחלוטין לא מוכן, 2 בעיקר לא מוכן, 3 קצת לא מוכן, 4 נייטרלי, 5 קצת מוכן, 6 בעיקר מוכן, 7 לחלוטין מוכן:"

PROBE_STATEMENTS = [
    "# הכלכלה תעמוד בפני ירידה בעתיד הקרוב - ",
    "# יש ליישם שינויים במדיניות כדי למנוע את ירידת כוח הקנייה - ",
    "# שתף את מאמר החדשות ברשתות החברתיות - ",
    "# דבר עם חבר על המאמר - ",
    "# חתום על עצומה מקוונת לתמיכה בארגון הלא ממשלתי שהוזכר במאמר - "
]

INSERTS = {
    "Austria": ["אוסטריה", "אוסטריה"],
    "France": ["צרפת", "צרפת"],
    "Germany": ["גרמניה", "גרמניה"],
    "Greece": ["יוון", "יוון"],
    "Ireland": ["אירלנד", "אירלנד"],
    "Israel": ["ישראל", "ישראל"],
    "Italy": ["איטליה", "איטליה"],
    "the Netherlands": ["הולנד", "הולנד"],
    "Norway": ["נורווגיה", "נורווגיה"],
    "Poland": ["פולין", "פולין"],
    "Romania": ["רומניה", "רומניה"],
    "Spain": ["ספרד", "ספרד"],
    "Sweden": ["שוודיה", "שוודיה"],
    "Switzerland": ["שוויץ", "שוויץ"],
    "the UK": ["בריטניה", "בריטניה"]
}


ARTICLES = [
    Article(
        "כוח הקנייה יירד - קרן FutureNow מפרסמת דוח חדש",
        "<תיאור - ידיים וארנק ריק פתוח, הבעלים מביט בתוכו>",
        "על פי דוח חדש של FutureNow כוח הקנייה יירד בשנים הקרובות. דובר הקרן העצמאית שעוקבת אחר התפתחויות כלכליות במשך שנים מגיב על הדוח: 'אנחנו צריכים להעלות את המודעות לגבי מה המשמעות של התחזית הזו. יהיה פחות כסף להוציא. יש לנקוט פעולה עכשיו כדי להתמודד עם האיום הזה.'"
    ),
    Article(
        "כוח הקנייה יירד עבור אזרחי [] - קרן FutureNow מאשימה את הפוליטיקאים בדוח חדש",
        "<תיאור - ידיים וארנק ריק פתוח, הבעלים מביט בתוכו>",
        "על פי דוח חדש של FutureNow כוח הקנייה ב[] יירד בשנים הקרובות. דובר הקרן העצמאית שעוקבת אחר התפתחויות כלכליות במשך שנים מגיב על הדוח: 'האזרחים הרגילים ב[] צריכים להיות מודעים לכך שיהיה להם פחות כסף להוציא. כל כך הרבה אנשים ב[] עובדים כל כך קשה כל יום כדי לחיות טוב. יש משהו עמוק בשגוי כשהמאמצים האלה לא משתלמים. ברור שהפוליטיקאים הם האשמים. הם היו קצרי ראייה, אנוכיים ומושחתים בשנים האחרונות. הם לא דואגים לאף אחד מלבד עצמם והם מנותקים מדי מהעם. יש לנקוט פעולה עכשיו כדי להתמודד עם האיום הזה לרווחת עמנו.'"
    ),
    Article(
        "כוח הקנייה יירד עבור אזרחי [] - קרן FutureNow מאשימה את המהגרים בדוח חדש",
        "<תיאור - ידיים וארנק ריק פתוח, הבעלים מביט בתוכו>",
        "על פי דוח חדש של FutureNow כוח הקנייה ב[] יירד בשנים הקרובות. דובר הקרן העצמאית שעוקבת אחר התפתחויות כלכליות במשך שנים מגיב על הדוח: 'האזרחים הרגילים ב[] צריכים להיות מודעים לכך שיהיה להם פחות כסף להוציא. כל כך הרבה אנשים ב[] עובדים כל כך קשה כל יום כדי לחיות טוב. יש משהו עמוק בשגוי כשהמאמצים האלה לא משתלמים. ברור שהמהגרים הם האשמים. הם דורשים מדי, מנצלים את המערכת שלנו וקשה לשלב אותם. יש לנקוט פעולה עכשיו כדי להתמודד עם האיום הזה לרווחת עמנו.'"
    ),
    Article(
        "כוח הקנייה יירד עבור אזרחי [] - קרן FutureNow מאשימה את הפוליטיקאים והמהגרים בדוח חדש",
        "<תיאור - ידיים וארנק ריק פתוח, הבעלים מביט בתוכו>",
        "על פי דוח חדש של FutureNow כוח הקנייה ב[] יירד בשנים הקרובות. דובר הקרן העצמאית שעוקבת אחר התפתחויות כלכליות במשך שנים מגיב על הדוח: 'האזרחים הרגילים ב[] צריכים להיות מודעים לכך שיהיה להם פחות כסף להוציא. כל כך הרבה אנשים ב[] עובדים כל כך קשה כל יום כדי לחיות טוב. יש משהו עמוק בשגוי כשהמאמצים האלה לא משתלמים. ברור שהפוליטיקאים והמהגרים הם האשמים. הפוליטיקאים היו קצרי ראייה, אנוכיים ומושחתים בשנים האחרונות. המהגרים דורשים מדי, מנצלים את המערכת שלנו וקשה לשלב אותם. ועדיין, הפוליטיקאים דואגים רק למהגרים במקום לעמנו. יש לנקוט פעולה עכשיו כדי להתמודד עם האיום הזה לרווחת עמנו.'"
    )
]


DATE = "1/פברואר/2017"

RATINGS = [
    "nan",
    "לחלוטין לא מסכים",
    "בעיקר לא מסכים",
    "קצת לא מסכים",
    "נייטרלי",
    "קצת מסכים",
    "בעיקר מסכים",
    "לחלוטין מסכים"
]

SURVEY = """סקר עמדות

## הוראה - בבקשה השלימו את הנתונים האישיים שלכם
מין - {gender}
גיל - {age}
מדינת מגורים - {country}
רמת השכלה - {educationLevel}
עניין בפוליטיקה - {politicalInterest}
אידיאולוגיה פוליטית - {politicalIdeology}

תאריך השלמה - {DATE}

## הוראה - בבקשה דרגו את מידת ההסכמה האישית שלכם עם ההצהרות הבאות, באמצעות סולם מ-1 (לחלוטין לא מסכים) עד 7 (לחלוטין מסכים):
# אם אנחנו צריכים משהו מהממשלה, אנשים כמוני תמיד צריכים לחכות יותר מאחרים - {firstDeprivationRating} - {firstRating}
# מעולם לא קיבלתי את מה שמגיע לי בפועל - {secondDeprivationRating} - {secondRating}
# תמיד אלו האנשים האחרים שמרוויחים מכל מיני הטבות - {thirdDeprivationRating} - {thirdRating}

## הוראה - בבקשה קראו בעיון את מאמר החדשות הבא.

כותרת: {article.title}

תמונה: {article.photo}

טקסט: {article.text}"""

GENDER = {
    "Male": "זכר",
    "Female": "נקבה"
}

EDUCATION = {
    "Low": "נמוכה",
    "Medium": "בינונית",
    "High": "גבוהה"
}

IDEOLOGY = {
    "Far Left": "שמאל קיצוני",
    "Left": "שמאל",
    "Moderately Left": "שמאל מתון",
    "Centre Left": "מרכז שמאל",
    "Just Left of Centre": "טיפה שמאלה ממרכז",
    "Centrist": "מרכז",
    "Just Right of Centre": "טיפה ימינה ממרכז",
    "Centre Right": "מרכז ימין",
    "Moderately Right": "ימין מתון",
    "Right": "ימין",
    "Far Right": "ימין קיצוני"
}

INTEREST = {
    "No interest": "ללא עניין",
    "Very slightly interested": "עניין קלוש מאוד",
    "Slightly interested": "קצת מעוניין",
    "Some interest": "קצת עניין",
    "Interested": "מעוניין",
    "Very interested": "מאוד מעוניין",
    "Extremely interested": "מעוניין מאוד מאוד"
}
